hpmicro/hpm_sdk/soc/HPM6P00/ip/hpm_gptmr_regs.h
/*
 * Copyright (c) 2021-2026 HPMicro
 *
 * SPDX-License-Identifier: BSD-3-Clause
 *
 */


#ifndef HPM_GPTMR_H
#define HPM_GPTMR_H

typedef struct {
    struct {
        __RW uint32_t CR;                      /* 0x0: Control Register */
        __RW uint32_t CMP[2];                  /* 0x4 - 0x8: Comparator register 0 */
        __RW uint32_t RLD;                     /* 0xC: Reload register */
        __RW uint32_t CNTUPTVAL;               /* 0x10: Counter update value register */
        __RW uint32_t BURST_CFG;               /* 0x14: burst_cfg */
        __R  uint32_t BURST_COUNT;             /* 0x18: burst_count */
        __R  uint8_t  RESERVED0[4];            /* 0x1C - 0x1F: Reserved */
        __R  uint32_t CAPPOS;                  /* 0x20: Capture rising edge register */
        __R  uint32_t CAPNEG;                  /* 0x24: Capture falling edge register */
        __R  uint32_t CAPPRD;                  /* 0x28: PWM period measure register */
        __R  uint32_t CAPDTY;                  /* 0x2C: PWM duty cycle measure register */
        __R  uint32_t CNT;                     /* 0x30: Counter */
        __R  uint8_t  RESERVED1[12];           /* 0x34 - 0x3F: Reserved */
    } CHANNEL[4];
    __R  uint8_t  RESERVED0[256];              /* 0x100 - 0x1FF: Reserved */
    __RW uint32_t SR;                          /* 0x200: Status register */
    __RW uint32_t IRQEN;                       /* 0x204: Interrupt request enable register */
    __W  uint32_t GCR;                         /* 0x208: Global control register */
} GPTMR_Type;


/* Bitfield definition for register of struct array CHANNEL: CR */
/*
 * CNTUPT (WO)
 *
 * 1- update counter to new value as CNTUPTVAL
 * This bit will be auto cleared after 1 cycle
 */
#define GPTMR_CHANNEL_CR_CNTUPT_MASK (0x80000000UL)
#define GPTMR_CHANNEL_CR_CNTUPT_SHIFT (31U)
#define GPTMR_CHANNEL_CR_CNTUPT_SET(x) (((uint32_t)(x) << GPTMR_CHANNEL_CR_CNTUPT_SHIFT) & GPTMR_CHANNEL_CR_CNTUPT_MASK)
#define GPTMR_CHANNEL_CR_CNTUPT_GET(x) (((uint32_t)(x) & GPTMR_CHANNEL_CR_CNTUPT_MASK) >> GPTMR_CHANNEL_CR_CNTUPT_SHIFT)

/*
 * BURST_MODE (RW)
 *
 * set to enable burst mode, timer will reload configured times(burst_cfg), then stop. user need clear CEN and set it to start timer agian.
 * NOTE: do not set burst_mode and opmode at same time
 */
#define GPTMR_CHANNEL_CR_BURST_MODE_MASK (0x80000UL)
#define GPTMR_CHANNEL_CR_BURST_MODE_SHIFT (19U)
#define GPTMR_CHANNEL_CR_BURST_MODE_SET(x) (((uint32_t)(x) << GPTMR_CHANNEL_CR_BURST_MODE_SHIFT) & GPTMR_CHANNEL_CR_BURST_MODE_MASK)
#define GPTMR_CHANNEL_CR_BURST_MODE_GET(x) (((uint32_t)(x) & GPTMR_CHANNEL_CR_BURST_MODE_MASK) >> GPTMR_CHANNEL_CR_BURST_MODE_SHIFT)

/*
 * CNT_MODE (RW)
 *
 * 0: internal counting mode, timer increase each gptmr clock cycle.
 * 1: external counting mode, timer increase at each input signal posedge, reload/compare feature can still work but change at input signal posedge.
 */
#define GPTMR_CHANNEL_CR_CNT_MODE_MASK (0x40000UL)
#define GPTMR_CHANNEL_CR_CNT_MODE_SHIFT (18U)
#define GPTMR_CHANNEL_CR_CNT_MODE_SET(x) (((uint32_t)(x) << GPTMR_CHANNEL_CR_CNT_MODE_SHIFT) & GPTMR_CHANNEL_CR_CNT_MODE_MASK)
#define GPTMR_CHANNEL_CR_CNT_MODE_GET(x) (((uint32_t)(x) & GPTMR_CHANNEL_CR_CNT_MODE_MASK) >> GPTMR_CHANNEL_CR_CNT_MODE_SHIFT)

/*
 * OPMODE (RW)
 *
 * 0:  round mode
 * 1:  one-shot mode, timer will stopped at reload point.user need clear CEN and set it to start timer agian.
 * NOTE: reload irq will be always set at one-shot mode at end
 */
#define GPTMR_CHANNEL_CR_OPMODE_MASK (0x20000UL)
#define GPTMR_CHANNEL_CR_OPMODE_SHIFT (17U)
#define GPTMR_CHANNEL_CR_OPMODE_SET(x) (((uint32_t)(x) << GPTMR_CHANNEL_CR_OPMODE_SHIFT) & GPTMR_CHANNEL_CR_OPMODE_MASK)
#define GPTMR_CHANNEL_CR_OPMODE_GET(x) (((uint32_t)(x) & GPTMR_CHANNEL_CR_OPMODE_MASK) >> GPTMR_CHANNEL_CR_OPMODE_SHIFT)

/*
 * MONITOR_SEL (RW)
 *
 * set to monitor input signal high level time(chan_meas_high)
 * clr to monitor input signal period(chan_meas_prd)
 */
#define GPTMR_CHANNEL_CR_MONITOR_SEL_MASK (0x10000UL)
#define GPTMR_CHANNEL_CR_MONITOR_SEL_SHIFT (16U)
#define GPTMR_CHANNEL_CR_MONITOR_SEL_SET(x) (((uint32_t)(x) << GPTMR_CHANNEL_CR_MONITOR_SEL_SHIFT) & GPTMR_CHANNEL_CR_MONITOR_SEL_MASK)
#define GPTMR_CHANNEL_CR_MONITOR_SEL_GET(x) (((uint32_t)(x) & GPTMR_CHANNEL_CR_MONITOR_SEL_MASK) >> GPTMR_CHANNEL_CR_MONITOR_SEL_SHIFT)

/*
 * MONITOR_EN (RW)
 *
 * set to monitor input signal period or high level time.
 * When this bit is set, if detected period less than val_0 or more than val_1, will set related irq_sts
 * * only can be used when trig_mode is selected as measure mode(100)
 * * the time may not correct after reload, so monitor is disabled after reload point, and enabled again after two continul posedge.
 * if no posedge after reload for more than val_1, will also assert irq_capt
 */
#define GPTMR_CHANNEL_CR_MONITOR_EN_MASK (0x8000U)
#define GPTMR_CHANNEL_CR_MONITOR_EN_SHIFT (15U)
#define GPTMR_CHANNEL_CR_MONITOR_EN_SET(x) (((uint32_t)(x) << GPTMR_CHANNEL_CR_MONITOR_EN_SHIFT) & GPTMR_CHANNEL_CR_MONITOR_EN_MASK)
#define GPTMR_CHANNEL_CR_MONITOR_EN_GET(x) (((uint32_t)(x) & GPTMR_CHANNEL_CR_MONITOR_EN_MASK) >> GPTMR_CHANNEL_CR_MONITOR_EN_SHIFT)

/*
 * CNTRST (RW)
 *
 * 1- reset counter
 */
#define GPTMR_CHANNEL_CR_CNTRST_MASK (0x4000U)
#define GPTMR_CHANNEL_CR_CNTRST_SHIFT (14U)
#define GPTMR_CHANNEL_CR_CNTRST_SET(x) (((uint32_t)(x) << GPTMR_CHANNEL_CR_CNTRST_SHIFT) & GPTMR_CHANNEL_CR_CNTRST_MASK)
#define GPTMR_CHANNEL_CR_CNTRST_GET(x) (((uint32_t)(x) & GPTMR_CHANNEL_CR_CNTRST_MASK) >> GPTMR_CHANNEL_CR_CNTRST_SHIFT)

/*
 * SYNCFLW (RW)
 *
 * 1- enable this channel to reset counter to reload(RLD) together with its previous channel.
 * This bit is not valid for channel 0.
 */
#define GPTMR_CHANNEL_CR_SYNCFLW_MASK (0x2000U)
#define GPTMR_CHANNEL_CR_SYNCFLW_SHIFT (13U)
#define GPTMR_CHANNEL_CR_SYNCFLW_SET(x) (((uint32_t)(x) << GPTMR_CHANNEL_CR_SYNCFLW_SHIFT) & GPTMR_CHANNEL_CR_SYNCFLW_MASK)
#define GPTMR_CHANNEL_CR_SYNCFLW_GET(x) (((uint32_t)(x) & GPTMR_CHANNEL_CR_SYNCFLW_MASK) >> GPTMR_CHANNEL_CR_SYNCFLW_SHIFT)

